In [1]:
import pandas as pd

In [2]:
cm_df = pd.read_csv('sampleData/disney_character_count.csv')
cm_df

         Character  Count
0      donald duck    179
1     mickey mouse    504
2            ariel   1383
3            tiana    455
4             elsa   1476
5            simba    382
6            belle   1270
7            mulan   1530
8          aladdin   1564
9            goofy    994
10  cruella de vil     36

In [5]:
ss_price_df = pd.read_csv('sampleData/usable_finance.csv')
ss_sentiment_df = pd.read_csv('sampleData/usable_sentiment.csv')

In [12]:
ss_price_df

            Date  Close_Price
0     2011-11-14    36.119999
1     2011-11-15    36.450001
2     2011-11-16    35.529999
3     2011-11-18    35.630001
4     2011-11-21    34.330002
...          ...          ...
1652  2021-06-16   174.660004
1653  2021-06-17   174.649994
1654  2021-06-18   172.419998
1655  2021-10-05   174.610001
1656  2021-10-27   169.550003

[1657 rows x 2 columns]

In [17]:
import numpy as np

def moving_average(x, w):
    return np.convolve(x, np.ones(w), 'valid') / w

s = ss_sentiment_df['Sentiment']

s = moving_average(s, 3)
s

array([4.        , 3.        , 2.66666667, ..., 3.33333333, 3.33333333,
       4.33333333])